TexasInstruments/mspm0-sdk/examples/nortos/LP_MSPM0C1104/driverlib/empty_driverlib_src/ti/driverlib/dl_timer.h
/*! @enum  DL_TIMER_SEC_COMP_DOWN_EVT */
typedef enum {
    /*! Selects Capture Compare down event based on Capture Compare register 0
     *! value */
    DL_TIMER_SEC_COMP_DOWN_EVT_SEL_CC0 = (GPTIMER_CCCTL_01_CC2SELD_SEL_CCD0),
    /*! Selects Capture Compare down event based on Capture Compare register 1
     *! value */
    DL_TIMER_SEC_COMP_DOWN_EVT_SEL_CC1 = (GPTIMER_CCCTL_01_CC2SELD_SEL_CCD1),
    /*! Selects Capture Compare down event based on Capture Compare register 2
     *! value */
    DL_TIMER_SEC_COMP_DOWN_EVT_SEL_CC2 = (GPTIMER_CCCTL_01_CC2SELD_SEL_CCD2),
    /*! Selects Capture Compare down event based on Capture Compare register 3
     *! value */
    DL_TIMER_SEC_COMP_DOWN_EVT_SEL_CC3 = (GPTIMER_CCCTL_01_CC2SELD_SEL_CCD3),
    /*! Selects Capture Compare down event based on Capture Compare register 4
     *! value */
    DL_TIMER_SEC_COMP_DOWN_EVT_SEL_CC4 = (GPTIMER_CCCTL_01_CC2SELD_SEL_CCD4),
    /*! Selects Capture Compare down event based on Capture Compare register 5
     *! value */
    DL_TIMER_SEC_COMP_DOWN_EVT_SEL_CC5 = (GPTIMER_CCCTL_01_CC2SELD_SEL_CCD5),
} DL_TIMER_SEC_COMP_DOWN_EVT;

/*! @enum  DL_TIMER_SEC_COMP_UP_EVT */
typedef enum {
    /*! Selects Capture Compare up event based on Capture Compare register 0
     *! value */
    DL_TIMER_SEC_COMP_UP_EVT_SEL_CC0 = (GPTIMER_CCCTL_01_CC2SELU_SEL_CCU0),
    /*! Selects Capture Compare up event based on Capture Compare register 1
     *! value */
    DL_TIMER_SEC_COMP_UP_EVT_SEL_CC1 = (GPTIMER_CCCTL_01_CC2SELU_SEL_CCU1),
    /*! Selects Capture Compare up event based on Capture Compare register 2
     *! value */
    DL_TIMER_SEC_COMP_UP_EVT_SEL_CC2 = (GPTIMER_CCCTL_01_CC2SELU_SEL_CCU2),
    /*! Selects Capture Compare up event based on Capture Compare register 3
     *! value */
    DL_TIMER_SEC_COMP_UP_EVT_SEL_CC3 = (GPTIMER_CCCTL_01_CC2SELU_SEL_CCU3),
    /*! Selects Capture Compare up event based on Capture Compare register 4
     *! value */
    DL_TIMER_SEC_COMP_UP_EVT_SEL_CC4 = (GPTIMER_CCCTL_01_CC2SELU_SEL_CCU4),
    /*! Selects Capture Compare up event based on Capture Compare register 5
     *! value */
    DL_TIMER_SEC_COMP_UP_EVT_SEL_CC5 = (GPTIMER_CCCTL_01_CC2SELU_SEL_CCU5),
} DL_TIMER_SEC_COMP_UP_EVT;

/*! @enum  DL_TIMER_SEC_COMP_UP_ACT_SEL */
typedef enum {
    /*! Second comparator output action is disabled. */
    DL_TIMER_SEC_COMP_UP_ACT_SEL_DISABLE = GPTIMER_CCACT_01_CC2UACT_DISABLED,
    /*! Timer channel is set high when the second comparator up counting event
     * is detected */
    DL_TIMER_SEC_COMP_UP_ACT_SEL_HIGH = GPTIMER_CCACT_01_CC2UACT_CCP_HIGH,
    /*! Timer channel is set low when the second comparator up counting event
     * is detected */
    DL_TIMER_SEC_COMP_UP_ACT_SEL_LOW = GPTIMER_CCACT_01_CC2UACT_CCP_LOW,
    /*! Timer channel is toggles when the second comparator up counting event
     * is detected */
    DL_TIMER_SEC_COMP_UP_ACT_SEL_TOGGLE = GPTIMER_CCACT_01_CC2UACT_CCP_TOGGLE,
} DL_TIMER_SEC_COMP_UP_ACT_SEL;

/*! @enum  DL_TIMER_SEC_COMP_DOWN_ACT_SEL */
typedef enum {
    /*! Second comparator output action is disabled. */
    DL_TIMER_SEC_COMP_DOWN_ACT_SEL_DISABLE = GPTIMER_CCACT_01_CC2DACT_DISABLED,
    /*! Timer channel is set high when the second comparator down counting event
     * is detected */
    DL_TIMER_SEC_COMP_DOWN_ACT_SEL_HIGH = GPTIMER_CCACT_01_CC2DACT_CCP_HIGH,
    /*! Timer channel is set low when the second comparator down counting event
     * is detected */
    DL_TIMER_SEC_COMP_DOWN_ACT_SEL_LOW = GPTIMER_CCACT_01_CC2DACT_CCP_LOW,
    /*! Timer channel is toggles when the second comparator down counting event
     * is detected */
    DL_TIMER_SEC_COMP_DOWN_ACT_SEL_TOGGLE =
        GPTIMER_CCACT_01_CC2DACT_CCP_TOGGLE,
} DL_TIMER_SEC_COMP_DOWN_ACT_SEL;

/*! @enum  DL_TIMER_SUPP_COMP_EVT_RC */
typedef enum {
    /*! Capture compare up and down events are always generated from the counter
     *! when their conditions are genreated */
    DL_TIMER_SUPP_COMP_EVT_RC_DISABLED = (GPTIMER_CCCTL_01_SCERCNEZ_DISABLED),
    /*! Capture compare up and down events are generated from the counter when
     *! their conditions are genreated and the repeat counter value is 0 */
    DL_TIMER_SUPP_COMP_EVT_RC_ENABLED = (GPTIMER_CCCTL_01_SCERCNEZ_ENABLED),
} DL_TIMER_SUPP_COMP_EVT_RC;

/*! @enum  DL_TIMER_FORCE_OUT */
typedef enum {
    /*! The CCP output value is unaffected */
    DL_TIMER_FORCE_OUT_DISABLED = (GPTIMER_CCACT_01_SWFRCACT_DISABLED),
    /*! Output value is set high */
    DL_TIMER_FORCE_OUT_HIGH = (GPTIMER_CCACT_01_SWFRCACT_CCP_HIGH),
    /*! Output value is set low */
    DL_TIMER_FORCE_OUT_LOW = (GPTIMER_CCACT_01_SWFRCACT_CCP_LOW),

} DL_TIMER_FORCE_OUT;

/*! @enum  DL_TIMER_FORCE_CMPL_OUT */
typedef enum {
    /*! The complementary CCP output value is unaffected */
    DL_TIMER_FORCE_CMPL_OUT_DISABLED =
        (GPTIMER_CCACT_01_SWFRCACT_CMPL_DISABLED),
    /*! Complementary CCP output is set high */
    DL_TIMER_FORCE_CMPL_OUT_HIGH = (GPTIMER_CCACT_01_SWFRCACT_CMPL_CCP_HIGH),
    /*! Complementary CCP output is set low */
    DL_TIMER_FORCE_CMPL_OUT_LOW = (GPTIMER_CCACT_01_SWFRCACT_CMPL_CCP_LOW),

} DL_TIMER_FORCE_CMPL_OUT;

/*! @enum  DL_TIMER_CORE_HALT */
typedef enum {
    /*! Timer will halt immediately, even if the resultant state will result in
        corruption if the system is restarted */
    DL_TIMER_CORE_HALT_IMMEDIATE =
        (GPTIMER_PDBGCTL_FREE_STOP | GPTIMER_PDBGCTL_SOFT_IMMEDIATE),
    /*! Timer blocks the debug freeze until it has reached a boundary where it
        can resume without corruption */
    DL_TIMER_CORE_HALT_DELAYED =
        (GPTIMER_PDBGCTL_FREE_STOP | GPTIMER_PDBGCTL_SOFT_DELAYED),
    /*! Timer ignores the state of the Core Halted input */
    DL_TIMER_CORE_HALT_FREE_RUN =
        (GPTIMER_PDBGCTL_FREE_RUN | GPTIMER_PDBGCTL_SOFT_DELAYED),
} DL_TIMER_CORE_HALT;

/*!
 *  @brief  Configuration struct for @ref DL_Timer_setClockConfig.
 */
typedef struct {
    /*! Selects timer module clock source @ref DL_TIMER_CLOCK*/
    DL_TIMER_CLOCK clockSel;
    /*! Selects the timer module clock divide ratio
    @ref DL_TIMER_CLOCK_DIVIDE */
    DL_TIMER_CLOCK_DIVIDE divideRatio;
    /*! Selects the timer module clock prescaler. Valid range 0-255 */
    uint8_t prescale;
} DL_Timer_ClockConfig;

/*!
 *  @brief  Configuration struct for @ref DL_Timer_initTimerMode.
 */
typedef struct {
    /*! One shot or Periodic mode configuration. One of
     * @ref DL_TIMER_TIMER_MODE */
    DL_TIMER_TIMER_MODE timerMode;
    /*! Actual period will be period_actual=(period +1)T_TIMCLK
     * where T_TIMCLK is the period of the timer source clock. */
    uint32_t period;
    /*! Start timer after configuration @ref DL_TIMER */
    DL_TIMER startTimer;
    /*! Generate intermediate counter interrupt
     * @ref DL_TIMER_INTERM_INT*/
    DL_TIMER_INTERM_INT genIntermInt;
    /*! Counter value when intermediate interrupt should be generated. This
     * member must be set to 0 when
     * @ref genIntermInt == DL_TIMER_INTERM_INT_DISABLED */
    uint16_t counterVal;
} DL_Timer_TimerConfig;

/*!
 * @brief Configuration struct for @ref DL_Timer_initCaptureMode.
 */
typedef struct {
    /*! Selects capture mode. One of @ref DL_TIMER_CAPTURE_MODE */
    DL_TIMER_CAPTURE_MODE captureMode;
    /*! Specifies the capture period. period_actual=(period +1)T_TIMCLK
     * where T_TIMCLK is the period of the timer source clock. */
    uint32_t period;
    /*! Start timer after configuration @ref DL_TIMER */
    DL_TIMER startTimer;
    /*! Specifies the edge detection mode. One of
        @ref DL_TIMER_CAPTURE_EDGE_DETECTION_MODE*/
    DL_TIMER_CAPTURE_EDGE_DETECTION_MODE edgeCaptMode;
    /*! Selects input channel used for capture mode */
    DL_TIMER_INPUT_CHAN inputChan;
    /*! Specifies if input should be inverted. One of
     *  @ref DL_TIMER_CC_INPUT_INV */
    uint32_t inputInvMode;
} DL_Timer_CaptureConfig;

/*!
 * @brief Configuration struct for @ref DL_Timer_initCaptureTriggerMode.
 */
typedef struct {
    /*! Selects capture mode. One of @ref DL_TIMER_CAPTURE_MODE */
    DL_TIMER_CAPTURE_MODE captureMode;
    /*! Specifies the capture period. period_actual=(period +1) * T_TIMCLK
     * where T_TIMCLK is the period of the timer source clock. */
    uint16_t period;
    /*! Start timer after configuration. One of @ref DL_TIMER */
    DL_TIMER startTimer;
} DL_Timer_CaptureTriggerConfig;

/*!
 * @brief Configuration struct for @ref DL_Timer_initCaptureCombinedMode.
 */
typedef struct {
    /*! Selects capture mode. One of @ref DL_TIMER_CAPTURE_COMBINED_MODE */
    DL_TIMER_CAPTURE_COMBINED_MODE captureMode;
    /*! Specifies the capture period. period_actual=(period +1)T_TIMCLK
     * where T_TIMCLK is the period of the timer source clock. */
    uint32_t period;
    /*! Start timer after configuration @ref DL_TIMER */
    DL_TIMER startTimer;
    /*! Selects input channel used for capture mode. One of @ref DL_TIMER_INPUT_CHAN */
    DL_TIMER_INPUT_CHAN inputChan;
    /*! Specifies if input should be inverted. One of
     *  @ref DL_TIMER_CC_INPUT_INV */
    uint32_t inputInvMode;
} DL_Timer_CaptureCombinedConfig;

/*!
 * @brief Configuration struct for @ref DL_Timer_initCompareMode.
 */
typedef struct {
    /*! Selects capture mode. One of @ref DL_TIMER_COMPARE_MODE */
    DL_TIMER_COMPARE_MODE compareMode;
    /*! Specifies the intial count value. In edge count mode this value will
     *  decrease everytime the configured edge detection mode is detected.
     *  The counter will be reset to this value after the reaching zero.
     *  Valid range [0-65535]. */
    uint16_t count;
    /*! Specifies the edge detection mode. One of
        @ref DL_TIMER_CAPTURE_EDGE_DETECTION_MODE*/
    DL_TIMER_COMPARE_EDGE_DETECTION_MODE edgeDetectMode;
    /*! Selects input channel used for compare mode. One of @ref DL_TIMER_INPUT_CHAN */
    DL_TIMER_INPUT_CHAN inputChan;
    /*! Specifies if input should be inverted. One of
     *  @ref DL_TIMER_CC_INPUT_INV */
    uint32_t inputInvMode;
    /*! Start timer after configuration. One of @ref DL_TIMER */
    DL_TIMER startTimer;
} DL_Timer_CompareConfig;

/*!
 * @brief Configuration struct for @ref DL_Timer_initCompareTriggerMode.
 */
typedef struct {
    /*! Selects capture mode. One of @ref DL_TIMER_COMPARE_MODE */
    DL_TIMER_COMPARE_MODE compareMode;
    /*! Specifies the intial count value. In edge count mode this value will
     *  decrease everytime the configured edge detection mode is detected.
     *  The counter will be reset to this value after the reaching zero.
     *  Valid range [0-65535]. */
    uint16_t count;
    /*! Specifies the edge detection mode. One of
        @ref DL_TIMER_CAPTURE_EDGE_DETECTION_MODE*/
    DL_TIMER_COMPARE_EDGE_DETECTION_MODE edgeDetectMode;
    /*! Start timer after configuration. One of @ref DL_TIMER */
    DL_TIMER startTimer;
} DL_Timer_CompareTriggerConfig;

/**
 * @brief Configuration struct for @ref DL_Timer_initPWMMode.
 */
typedef struct {
    /*! Specifies the pwm period. The actual value configured to LOAD register
     *  depends on the pwmMode selected. When
     *  pwmMode = DL_TIMER_PWM_MODE_EDGE_ALIGN, LOAD = (period -1). When
     *  pwmMode = DL_TIMER_PWM_MODE_CENTER_ALIGN, LOAD = (period / 2).
     *  Actual PWM freq = (Timer_freq/(prescaler * divideRatio * period))
     */
    uint32_t period;
    /*! Specifies the PWM Mode. One of @ref DL_TIMER_PWM_MODE */
    DL_TIMER_PWM_MODE pwmMode;
    /*! Start timer after configuration @ref DL_TIMER */
    DL_TIMER startTimer;
} DL_Timer_PWMConfig;

/**
 * @brief Configuration structure to backup Timer peripheral state before
 *        entering STOP or STANDBY mode. Not required after PG 1.0 silicon.
 *        Used by @ref DL_Timer_saveConfiguration and
 *        @ref DL_Timer_restoreConfiguration
 */
typedef struct {
    /*! Timer subscriber 0 channel ID. Value between 0 - 15. */
    uint32_t sub0PortConf;
    /*! Timer subscriber 1 channel ID. Value between 0 - 15. */
    uint32_t sub1PortConf;
    /*! Timer publisher 0 channel ID. Value between 0 - 15. */
    uint32_t pub0PortConf;
    /*! Timer publisher 1 channel ID. Value between 0 - 15. */
    uint32_t pub1PortConf;
    /*! Timer clockDivider configuration.*/
    uint32_t clkDivConf;
    /*! Timer clock prescaler configuration.*/
    uint32_t clockPscConf;
    /*! Timer Clock Source Select configuration.*/
    uint32_t clkSelConf;
    /*! Timer Clock configuration.*/
    uint32_t countClkConf;
    /*! Timer interrupt configuration for EVENT0.*/
    uint32_t intEvnt0Conf;
    /*! Timer interrupt configuration for EVENT1.*/
    uint32_t intEvnt1Conf;
    /*! Timer interrupt configuration for EVENT2.*/
    uint32_t intEvnt2Conf;
    /*! Timer CCP Direction configuration.*/
    uint32_t ccpDirConf;
    /*! Timer CCP Output forced low configuration.*/
    uint32_t outDisConf;
    /*! Timer Cross Timer Trigger Control configuration.*/
    uint32_t crossTrigCtl;
    /*! Timer Cross Trigger Configuration */
    uint32_t tSelConf;
    /*! Timer Cross Timer Trigger*/
    uint32_t crossTrigConf;
    /*! Timer counter value. Timer counter value is stored but user can
     *  specify if counter is restore via restoreCounter argument in
     *  @ref DL_Timer_restoreConfiguration */
    uint32_t cntVal;
    /*! Timer counter control configuration */
    uint32_t cntCtlConf;
    /*! Timer load value */
    uint32_t loadVal;
    /*! Timer Capture or Compare 0 value */
    uint32_t cc0Val;
    /*! Timer Capture or Compare 1 value */
    uint32_t cc1Val;
    /*! Timer Capture or Compare Control Register 0 */
    uint32_t cc0Ctl;
    /*! Timer Capture or Compare Control Register 1 */
    uint32_t cc1Ctl;
    /*! Timer Capture or Compare Output Control Register 0 */
    uint32_t cc0OutCtl;
    /*! Timer Capture or Compare Output Control Register 1 */
    uint32_t cc1OutCtl;
    /*! Timer Capture or Compare Signal Generator Action Control Register 0 */
    uint32_t cc0ActCtl;
    /*! Timer Capture or Compare Signal Generator Action Control Register 1 */
    uint32_t cc1ActCtl;
    /*! Timer Capture or Compare Input Filter and Inversion Control
     *  Register 0 */
    uint32_t in0FiltCtl;
    /*! Timer Capture or Compare Input Filter and Inversion Control
     *  Register 1 */
    uint32_t in1FiltCtl;
    /*! Boolean flag indicating whether or not a valid configuration structure
     *  exists. Should not be modified by the user. */
    bool backupRdy;
} DL_Timer_backupConfig;

/*! @enum DL_TIMER_QEI_MODE */
typedef enum {
    /*! Set QEI to 2 input mode: PHA->CCP0, PHB->CCP1. */
    DL_TIMER_QEI_MODE_2_INPUT =
        (GPTIMER_CTRCTL_CLC_QEI_2INP | GPTIMER_CTRCTL_CAC_QEI_2INP |
            GPTIMER_CTRCTL_CZC_QEI_2INP),
    /*! Set QEI to 3 input mode: PHA->CCP0, PHB->CCP1, Index input signal->IDX. */
    DL_TIMER_QEI_MODE_3_INPUT =
        (GPTIMER_CTRCTL_CLC_QEI_3INP | GPTIMER_CTRCTL_CAC_QEI_3INP |
            GPTIMER_CTRCTL_CZC_QEI_3INP),
} DL_TIMER_QEI_MODE;

/*! @enum DL_TIMER_QEI_DIRECTION */
typedef enum {
    /*! Encoder counter going down */
    DL_TIMER_QEI_DIR_DOWN = GPTIMER_QDIR_DIR_DOWN,
    /*! Encoder counter going up */
    DL_TIMER_QEI_DIR_UP = GPTIMER_QDIR_DIR_UP,
} DL_TIMER_QEI_DIRECTION;

/**
 * @brief Enables power on timer module
 *
 * @param gptimer              Pointer to the register overlay for the
 *                             peripheral
 */
__STATIC_INLINE void DL_Timer_enablePower(GPTIMER_Regs *gptimer)
{
    gptimer->GPRCM.PWREN =
        (GPTIMER_PWREN_KEY_UNLOCK_W | GPTIMER_PWREN_ENABLE_ENABLE);
}

/**
 * @brief Disables power on timer module
 *
 * @param gptimer              Pointer to the register overlay for the
 *                             peripheral
 */
__STATIC_INLINE void DL_Timer_disablePower(GPTIMER_Regs *gptimer)
{
    gptimer->GPRCM.PWREN =
        (GPTIMER_PWREN_KEY_UNLOCK_W | GPTIMER_PWREN_ENABLE_DISABLE);
}

/**
 * @brief Returns if power on timer module is enabled
 *
 * @param gptimer              Pointer to the register overlay for the
 *                             peripheral
 *
 * @return true if power is enabled
 * @return false if power is disabled
 */
__STATIC_INLINE bool DL_Timer_isPowerEnabled(GPTIMER_Regs *gptimer)
{
    return ((gptimer->GPRCM.PWREN & GPTIMER_PWREN_ENABLE_MASK) ==
            GPTIMER_PWREN_ENABLE_ENABLE);
}

/**
 * @brief Resets timer peripheral
 *
 * @param gptimer              Pointer to the register overlay for the
 *                             peripheral
 */
__STATIC_INLINE void DL_Timer_reset(GPTIMER_Regs *gptimer)
{
    gptimer->GPRCM.RSTCTL =
        (GPTIMER_RSTCTL_KEY_UNLOCK_W | GPTIMER_RSTCTL_RESETSTKYCLR_CLR |
            GPTIMER_RSTCTL_RESETASSERT_ASSERT);
}

/**
 * @brief Returns if timer peripheral has been reset
 *
 * @param gptimer              Pointer to the register overlay for the
 *                             peripheral
 *
 * @return true if peripheral was reset
 * @return false if peripheral wasn't reset
 */
__STATIC_INLINE bool DL_Timer_isReset(GPTIMER_Regs *gptimer)
{
    return ((gptimer->GPRCM.STAT & GPTIMER_STAT_RESETSTKY_MASK) ==
            GPTIMER_STAT_RESETSTKY_RESET);
}

/**
 *  @brief      Sets CCP Direction
 *
 *  @param[in]  gptimer        Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  ccpConfig      Direction configuration for CCP as input or
 *                             output. Bitwise OR  of @ref DL_TIMER_CCx
 */
__STATIC_INLINE void DL_Timer_setCCPDirection(
    GPTIMER_Regs *gptimer, uint32_t ccpConfig)
{
    gptimer->COMMONREGS.CCPD = (ccpConfig);
}

/**
 *  @brief      Gets CCP Direction
 *
 *  @param[in]  gptimer        Pointer to the register overlay for the
 *                             peripheral
 *
 *  @return     Bitwise OR of CCP Direction configuration @ref DL_TIMER_CCx
 */
__STATIC_INLINE uint32_t DL_Timer_getCCPDirection(GPTIMER_Regs *gptimer)
{
    return (gptimer->COMMONREGS.CCPD);
}

/**
 *  @brief      Forces the output of the timer low via the ODIS register.
 *              This can be useful during shutdown or configuring the timer.
 *              The output pin still passes through the inversion (INV) bit.
 *              See figure "Output connection for TIMG" in Technical
 *              Reference Manual (TRM) for diagram.
 *              DL_Timer_overrideCCPOut() can be used for for similar
 *              functionality, where independent overrride settings for the
 *              output and complementary output channels can be configured.
 *
 *  @param[in]  gptimer        Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  ccp0Config     Output Configuration for CCP0. One of @ref
 *                             DL_TIMER_CCP_DIS_OUT
 *  @param[in]  ccp1Config     Output Configuration for CCP1. One of @ref
 *                             DL_TIMER_CCP_DIS_OUT
 */
__STATIC_INLINE void DL_Timer_setCCPOutputDisabled(GPTIMER_Regs *gptimer,
    DL_TIMER_CCP_DIS_OUT ccp0Config, DL_TIMER_CCP_DIS_OUT ccp1Config)
{
    DL_Common_updateReg(&gptimer->COMMONREGS.ODIS,
        (((uint32_t) ccp0Config) |
            ((uint32_t) ccp1Config << GPTIMER_ODIS_C0CCP1_OFS)),
        (GPTIMER_ODIS_C0CCP0_MASK | GPTIMER_ODIS_C0CCP1_MASK));
}

/**
 *  @brief      Sets CCP Output configuration for timer instances with more than
 *  two CCP channels via the ODIS register. The output pin still passes through
 *  the inversion (INV) bit.
 *
 *  @note Refer to device datasheet to determine if timer instance supports
 *  this feature. Only Timer instance which supports more than two CCP channels
 *  should use this API.
 *
 *  @param[in]  gptimer        Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  ccpOdisConfig  Output Configuration for CCP channels. Bitwise OR
 *                             @ref DL_TIMER_CCP0_DIS_OUT_ADV,
 *                             @ref DL_TIMER_CCP1_DIS_OUT_ADV,
 *                             @ref DL_TIMER_CCP2_DIS_OUT_ADV,
 *                             @ref DL_TIMER_CCP3_DIS_OUT_ADV
 */
__STATIC_INLINE void DL_Timer_setCCPOutputDisabledAdv(
    GPTIMER_Regs *gptimer, uint32_t ccpOdisConfig)
{
    DL_Common_updateReg(&gptimer->COMMONREGS.ODIS, (ccpOdisConfig),
        (GPTIMER_ODIS_C0CCP0_MASK | GPTIMER_ODIS_C0CCP1_MASK |
            GPTIMER_ODIS_C0CCP2_MASK | GPTIMER_ODIS_C0CCP3_MASK));
}

/**
 *  @brief      Configure timer source clock
 *  @param[in]  gptimer        Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  config         Pointer to the clock configuration struct
 *                             @ref DL_Timer_ClockConfig.
 */
void DL_Timer_setClockConfig(
    GPTIMER_Regs *gptimer, DL_Timer_ClockConfig *config);

/**
 *  @brief      Get  timer source clock configuration
 *  @param[in]  gptimer        Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  config         Pointer to the clock configuration struct
 *                             @ref DL_Timer_ClockConfig.
 */
void DL_Timer_getClockConfig(
    GPTIMER_Regs *gptimer, DL_Timer_ClockConfig *config);

/**
 *  @brief      Enable timer clock
 *  @param[in]  gptimer        Pointer to the register overlay for the
 *                             peripheral
 *
 */
__STATIC_INLINE void DL_Timer_enableClock(GPTIMER_Regs *gptimer)
{
    gptimer->COMMONREGS.CCLKCTL = (GPTIMER_CCLKCTL_CLKEN_ENABLED);
}

/**
 *  @brief      Disable timer clock
 *  @param[in]  gptimer        Pointer to the register overlay for the
 *                             peripheral
 *
 */
__STATIC_INLINE void DL_Timer_disableClock(GPTIMER_Regs *gptimer)
{
    gptimer->COMMONREGS.CCLKCTL = (GPTIMER_CCLKCTL_CLKEN_DISABLED);
}

/**
 *  @brief      Returns if timer clock is disabled
 *  @param[in]  gptimer        Pointer to the register overlay for the
 *                             peripheral
 *
 *  @return true if clock is enabled
 *  @return false if clock is disabled
 */
__STATIC_INLINE bool DL_Timer_isClockEnabled(GPTIMER_Regs *gptimer)
{
    return ((gptimer->COMMONREGS.CCLKCTL & GPTIMER_CCLKCTL_CLKEN_MASK) ==
            GPTIMER_CCLKCTL_CLKEN_ENABLED);
}

/**
 *  @brief      Configure Cross Timer Trigger
 *
 *  @param[in]  gptimer           Pointer to the register overlay for the
 *                                peripheral
 *  @param[in]  ctSource          Selects cross trigger source.
 *                                @ref DL_TIMER_CROSS_TRIG_SRC
 *
 *  @param[in]  enInTrigCond      Cofigures Input Trigger Conditions to the
 *                                Timer module as a condition for Cross Triggers *                                @ref DL_TIMER_CROSS_TRIGGER_INPUT
 *
 * @param[in]  enCrossTrig        Configures Timer Cross trigger
 *                                @ref DL_TIMER_CROSS_TRIGGER_MODE
 *
 */
__STATIC_INLINE void DL_Timer_configCrossTrigger(GPTIMER_Regs *gptimer,
    DL_TIMER_CROSS_TRIG_SRC ctSource,
    DL_TIMER_CROSS_TRIGGER_INPUT enInTrigCond,
    DL_TIMER_CROSS_TRIGGER_MODE enCrossTrig)
{
    gptimer->COMMONREGS.CTTRIGCTL =
        (uint32_t)((uint32_t) ctSource | (uint32_t) enInTrigCond |
                   (uint32_t) enCrossTrig);
}

/**
 *  @brief      Configure Cross Timer Trigger source
 *
 *  @param[in]  gptimer           Pointer to the register overlay for the
 *                                peripheral
  *  @param[in]  ctSource          Selects cross trigger source.
 *                                @ref DL_TIMER_CROSS_TRIG_SRC
 *
 */
__STATIC_INLINE void DL_Timer_configCrossTriggerSrc(
    GPTIMER_Regs *gptimer, DL_TIMER_CROSS_TRIG_SRC ctSource)
{
    DL_Common_updateReg(&gptimer->COMMONREGS.CTTRIGCTL, (uint32_t) ctSource,
        GPTIMER_CTTRIGCTL_EVTCTTRIGSEL_MASK);
}

